{
  "common": {
    "needInternetFirstSync": "Для первой загрузки данных требуется подключение к интернету",
    "retry": "Повторить",
    "sync": "Синхронизировать",
    "syncing": "Синхронизация данных...",
    "syncFailed": "Синхронизация не удалась",
    "pleaseWait": "Пожалуйста, подождите",
    "error": "Ошибка",
    "success": "Успешно",
    "ok": "OK",
    "syncError": "Не удалось выполнить синхронизацию. Проверьте подключение к интернету.",
    "back": "Назад",
    "cancel": "Отмена",
    "done": "Готово",
    "save": "Сохранить",
    "share": "Поделиться",
    "sending": "Отправка...",
    "send": "Отправить"
  },
  "tabs": {
    "latest": "Последние",
    "favorites": "Избранные",
    "fathers": "Все отцы",
    "settings": "Настройки",
    "about": "О нас"
  },
  "latest": {
    "title": "Последние цитаты",
    "empty": "Нет цитат"
  },
  "favorites": {
    "title": "Избранные",
    "empty": "Нет избранных цитат",
    "addToFavorites": "В избранное",
    "removeFromFavorites": "Убрать из избранного"
  },
  "fathers": {
    "title": "Все отцы",
    "quotesCount": "Всего цитат: {{count}}",
    "empty": "Нет отцов"
  },
  "quote": {
    "addToFavorites": "♡ В избранное",
    "removeFromFavorites": "♥ Убрать из избранного",
    "share": "Поделиться"
  },
  "settings": {
    "title": "Настройки",
    "language": "ЯЗЫК ПРИЛОЖЕНИЯ",
    "notifications": "УВЕДОМЛЕНИЯ",
    "enableNotifications": "Включить рассылку",
    "weekdayTime": "Оповещения в будни",
    "weekendTime": "Оповещения в выходные",
    "sound": "Мелодия",
    "save": "Сохранить",
    "development": "РАЗРАБОТКА",
    "resetApp": "Сбросить приложение",
    "resetConfirm": "Очистить все локальные данные и повторно синхронизировать с Supabase?",
    "resetSuccess": "Приложение сброшено. Перезагрузите приложение.",
    "permission": "Разрешение",
    "permissionMessage": "Разреши уведомления в настройках телефона",
    "warning": "Предупреждение",
    "notificationsNotScheduled": "Уведомления не были запланированы. Проверьте разрешения и настройки устройства.",
    "settingsSaved": "Настройки сохранены",
    "settingsSavedWithCount": "Настройки сохранены. Запланировано {{count}} уведомлений.",
    "saveError": "Ошибка при сохранении: {{error}}",
    "soundDefault": "Стандартный",
    "soundBell": "Афонское било",
    "soundSoft": "Тихий",
    "selectSound": "Выберите мелодию",
    "privacyPolicy": "Политика конфиденциальности"
  },
  "about": {
    "title": "О нас",
    "description": "Приложение для чтения духовных цитат святых отцов. Работает офлайн после первой загрузки.",
    "feedback": "Обратная связь",
    "messagePlaceholder": "Ваше сообщение...",
    "contactPlaceholder": "Контакт (email или телефон) — необязательно",
    "send": "Отправить",
    "sending": "Отправка...",
    "errorTitle": "Ошибка",
    "errorMessage": "Введите сообщение",
    "doneTitle": "Готово",
    "messageSaved": "Сообщение сохранено и будет отправлено при появлении интернета.",
    "messageSent": "Сообщение отправлено."
  },
  "privacy": {
    "title": "Политика конфиденциальности",
    "lastUpdated": "Дата вступления в силу: 13 февраля 2025 г.",
    "intro": "Настоящая Политика конфиденциальности описывает, каким образом приложение «Цитаты святых отцов» (далее — «Приложение»), разработанное Retree (далее — «мы», «нас»), собирает, использует и защищает вашу информацию. Используя Приложение, вы соглашаетесь с условиями данной Политики.",
    "s1Title": "1. Какие данные мы собираем",
    "s1Body": "Приложение разработано с принципом минимального сбора данных.\n\n• Данные на устройстве: выбор языка, настройки уведомлений, список избранных цитат и загруженный контент хранятся исключительно на вашем устройстве в локальной базе данных SQLite.\n\n• Обратная связь (по вашему желанию): если вы решите отправить нам сообщение через форму обратной связи, мы получим текст вашего сообщения и контактные данные (email или телефон), если вы их укажете.\n\n• Мы НЕ собираем: имя, местоположение, идентификаторы устройства, IP-адрес, данные об использовании приложения, файлы cookie или иные данные для отслеживания.",
    "s2Title": "2. Как мы используем данные",
    "s2Body": "• Локальные данные используются исключительно для работы Приложения на вашем устройстве (отображение цитат, сохранение настроек, планирование уведомлений).\n\n• Сообщения обратной связи используются только для улучшения Приложения и ответа на ваши обращения.\n\n• Мы не используем ваши данные для рекламы, профилирования или маркетинга.",
    "s3Title": "3. Хранение и безопасность данных",
    "s3Body": "• Все пользовательские настройки и контент хранятся локально на вашем устройстве. При удалении Приложения эти данные удаляются.\n\n• Сообщения обратной связи передаются по зашифрованному каналу (HTTPS) и хранятся на защищённых серверах Supabase в соответствии с их политикой безопасности.\n\n• Мы не храним персональные данные дольше, чем это необходимо для обработки вашего обращения.",
    "s4Title": "4. Сторонние сервисы",
    "s4Body": "Приложение использует следующие сторонние сервисы:\n\n• Supabase (supabase.com) — для первоначальной загрузки и синхронизации контента (цитаты и изображения святых отцов). При синхронизации передаются только запросы на получение контента; персональные данные не отправляются.\n\n• Expo (expo.dev) — платформа для сборки и распространения Приложения. Expo может собирать обезличенную техническую информацию о сборках. Подробнее: expo.dev/privacy.\n\nМы не используем рекламные сети, аналитические SDK или трекеры.",
    "s5Title": "5. Уведомления",
    "s5Body": "Приложение может отправлять локальные push-уведомления с напоминанием о чтении цитат. Уведомления планируются на устройстве и не требуют передачи данных на сервер. Вы можете включить или отключить уведомления в настройках Приложения или в системных настройках устройства в любое время.",
    "s6Title": "6. Конфиденциальность детей",
    "s6Body": "Приложение не предназначено для детей младше 4 лет и не собирает сознательно персональные данные детей. Контент Приложения носит образовательный и духовный характер и подходит для всех возрастных групп.",
    "s7Title": "7. Ваши права",
    "s7Body": "Вы имеете право:\n\n• Удалить все локальные данные, удалив Приложение с устройства.\n• Запросить удаление отправленных сообщений обратной связи, связавшись с нами.\n• Отключить уведомления в любое время.\n• Отказаться от использования формы обратной связи — это полностью добровольная функция.",
    "s8Title": "8. Изменения в Политике",
    "s8Body": "Мы можем обновлять данную Политику конфиденциальности. Актуальная версия всегда доступна в разделе «Настройки» Приложения. Продолжая использовать Приложение после изменений, вы принимаете обновлённые условия.",
    "s9Title": "9. Связь с нами",
    "s9Body": "Если у вас есть вопросы или запросы, касающиеся конфиденциальности, свяжитесь с нами:\n\n• Через форму обратной связи в разделе «О нас» в Приложении.\n• По электронной почте: davidik0313@gmail.com"
  }
}

